app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 0)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)