app/controllers/proyectos_controller.rb

  def index
    @proyectos = Proyecto.all
---
SELECT * FROM "proyectos"

  def edit
    @proyecto = Proyecto.find(params[:id])
---
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 2)

  def archive
    @proyecto = Proyecto.find(params[:id])
    respond_to do |format|
       archivado = true
       archivado = false if @proyecto.archivado

      if @proyecto.update_attributes({:archivado => archivado})
       @proyectos = Proyecto.all
---
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 1)
UPDATE "proyectos" SET "updated_at" = '2011-01-14 16:44:52', "archivado" = 't' WHERE "id" = 1
SELECT * FROM "proyectos"