app/controllers/sessions_controller.rb

SELECT * FROM "usuarios" WHERE ("usuarios"."email" = 'sacardelxml@') LIMIT 1
SELECT * FROM "usuarios"
INSERT INTO "usuarios" ("nombres", "created_at", "perfil", "updated_at", "password", "email") VALUES('Eduardo Offermann', '2011-01-14 10:59:03', 'ADMIN', '2011-01-14 10:59:03', NULL, 'eduardo.offermann@continuum.cl')
---
  def show
    if params[:token].nil?
      redirect_to(session[:redirect_to])
      return
    end

    client = GData::Client::Contacts.new
    client.authsub_token = params[:token] # extract the single-use token from the URL query params
    session[:token] = client.auth_handler.upgrade()
    client.authsub_token = session[:token] if session[:token]

    feed = client.get('http://www.google.com/m8/feeds/contacts/default/full?max-results=0').to_xml

    nombre_usuario = ''
    email_usuario = ''
    feed.elements.each('author') do |entry|
        nombre_usuario = entry.elements['name'].text
        email_usuario = entry.elements['email'].text
    end

    usuario = Usuario.find_by_email(email_usuario)
    if usuario.nil?
      usuario = Usuario.new
      usuario.nombres = nombre_usuario
      usuario.email = email_usuario
      usuario.perfil = Usuario.all.length == 0 ? 'ADMIN' : 'USUARIO'
      usuario.save