app/controllers/sessions_controller.rb

  def store
    if params[:token].nil?
       destroy
      return
    end
    client = GData::Client::Contacts.new
    client.authsub_token = params[:token] # extract the single-use token from the URL query params
    session[:token] = client.auth_handler.upgrade()
    client.authsub_token = session[:token] if session[:token]
    feed = client.get('http://www.google.com/m8/feeds/contacts/default/full?max-results=0').to_xml
    nombre_usuario = ''
    email_usuario = ''
    feed.elements.each('author') do |entry|
        nombre_usuario = entry.elements['name'].text
        email_usuario = entry.elements['email'].text
    end
    usuario = Usuario.find_by_email(email_usuario)
    if usuario.nil?
      usuario = Usuario.new
      usuario.nombres = nombre_usuario
      usuario.email = email_usuario
      usuario.perfil = Usuario.all.length == 0 ? 'ADMIN' : 'USUARIO'
      usuario.time_zone = Time.zone.name
      usuario.save
---
SELECT * FROM "usuarios" WHERE ("usuarios"."email" = 'eduardo.offermann@continuum.cl') LIMIT 1
SELECT * FROM "usuarios"
INSERT INTO "usuarios" ("nombres", "created_at", "perfil", "updated_at", "password", "email") VALUES('Eduardo Offermann', '2011-01-14 12:51:07', 'ADMIN', '2011-01-14 12:51:07', NULL, 'eduardo.offermann@continuum.cl')