app/controllers/tareas_controller.rb

SELECT * FROM "tareas"
---
  def index
    @tareas = Tarea.all