app/controllers/timesheet_controller.rb

SELECT * FROM "clientes"
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 1)
SELECT * FROM "tareas" WHERE (tipo = 'Facturable')
SELECT * FROM "usuarios" WHERE (rut = '15587917') LIMIT 1
---
  def index

    @clientesProyectos = Array.new

    Cliente.all.each do |cli|

      c = ClienteObj.new
      c.id = cli.id
      c.descripcion = cli.descripcion
      c.proyectos = Proyecto.find(:all, :conditions => ["cliente_id = ?", cli.id])

      @clientesProyectos << c

    end

    @tareas_facturables = Tarea.find_facturables()
    @tareas_no_facturables = Tarea.find_no_facturables()

    @fecha = params[:fecha]

    if (@fecha.nil? || @fecha == '')
      @fecha = Temporizador.fechaActual().to_date()
    end

    @usuario = session[:usuario]
    @temporizadores = Temporizador.find_por_usuario_fecha(@usuario, @fecha)

INSERT INTO "temporizadors" ("proyecto_id", "created_at", "stop", "usuario_id", "updated_at", "descripcion", "iniciado", "tarea_id", "start") VALUES(1, '2011-01-06 11:28:01', '2011-01-06 11:28:01', 1, '2011-01-06 11:28:01', '111', 1, 1, '2011-01-06 11:28:01')
SELECT * FROM "usuarios" WHERE (rut = '15587917') LIMIT 1
---
  def create

    iniciado = params[:iniciado]

    fechaActual = Temporizador.fechaActual()

    @tempo = Temporizador.new(params[:temporizador])
    @tempo.iniciado = iniciado
    @tempo.start = fechaActual
    @tempo.stop = fechaActual
    @tempo.save

    @fecha = params[:fecha]

    if (@fecha.nil? || @fecha == '')
      @fecha = fechaActual.to_date()
    end

    @usuario = session[:usuario]
    @temporizadores = Temporizador.find_por_usuario_fecha(@usuario, @fecha)

SELECT * FROM "temporizadors" WHERE ("temporizadors"."id" = 153)
UPDATE "temporizadors" SET "updated_at" = '2011-01-06 11:25:07', "descripcion" = 'test3' WHERE "id" = 153
---
  def edit

    @tempo = Temporizador.find(params[:id])
    @tempo.update_attributes(params[:temporizador])

SELECT * FROM "temporizadors" WHERE ("temporizadors"."id" = 153)
UPDATE "temporizadors" SET "updated_at" = '2011-01-06 10:41:42', "iniciado" = 0, "stop" = '2011-01-06 10:41:40' WHERE "id" = 153
---
  def update

    @tempo = Temporizador.find(params[:id])

    begin

      tiempos = params[:time].to_s.split(':')
      stop = @tempo.start + (tiempos[0].to_i.hours + tiempos[1].to_i.minutes + tiempos[2].to_i.seconds + tiempos[3].to_i.days)

      if (params[:accion] == 'start')
        @tempo.update_attributes({:stop => stop, :iniciado => 1})

SELECT * FROM "temporizadors" WHERE ("temporizadors"."id" = 157)
DELETE FROM "temporizadors" WHERE "id" = 157
---
  def delete
    @temporizador = Temporizador.find(params[:id])
    @temporizador.destroy