app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
---
  def show

    @usuario = Usuario.find(params[:id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
---
  def edit

    @usuario = Usuario.find(params[:id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 4)
DELETE FROM "usuarios" WHERE "id" = 4
---
  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy